# -*- coding: utf-8 -*-
"""
Created on Mon Apr 18 11:53:09 2022

@author: PCUSER
"""

from django.contrib.auth.decorators import permission_required
from django.views.decorators.csrf import csrf_exempt
from django.shortcuts import render


from .views_monthlyAlterStuff import DBfunc 
DBv = DBfunc()

#from .views_monthlyAlterStuff import NowTimeDBs 


#DBv = NowTimeDBs()  #從views_monthlyAlterStuff.py取得每月需要的資料庫變數

#DBv.show() 
#DB = Stock6Sign202203  #每個月更換這裡
DBv.getRightDB()
DB = DBv.z  #每個月的主要資料庫  #y= 上個月 x = 上上個月
@permission_required('myapp.Can_enter_stock6 DB', login_url='/login2/')
def stock6OTC(request):

    
    if request.method == "POST":  #假如是以POST方式才處理
        mess = request.POST['groupid']  #取得表單輸入內容
        



    else:
        mess = "N/A"


    return render(request, "stock6OTC.html", locals())





@permission_required('myapp.Can_enter_stock6 DB', login_url='/login2/')
#def stock6listall202102otc(request, mess):
def stock6listallotc(request, mess):

    
    #上櫃化學工業
    otc1 = ['1742','4702','4706','4707','4711','4714','4716','4721','4741','4754','4767','6506','6509']
    #上櫃文化創意產業
    otc2 = ['2926','3064','3083','3086','3293','3546','3629','4803','4806','4946','5263','5478','6101','6111','6144','6169','6180','6294','6482','6542','6596','8446','8450','8489','8923','9949']
    #上櫃紡織工業    
    otc3 = ['4401','4402','4406','4413','4417','4419','4420','4429','4432','4433']
    #上櫃半導體工業    
    otc4 = ['3073','3105','3122','3141','3169','3219','3227','3228','3259','3260','3264','3265','3268','3317','3372','3374','3438','3527','3529','3555','3556','3567','3581','3675','3680','3707','4966','4971','4973','4991','5272','5274','5299','5302','5314','5344','5347','5351','5425','5468','5483','5487','6103','6104','6129','6138','6147','6182','6198','6223','6229','6233','6237','6261','6287','6291','6411','6435','6457','6462','6485','6488','6494','6510','6532','6548','6568','6594','6640','6643','6679','6683','6716','6732','8024','8040','8054','8086','8088','8277','8299']
    #上櫃生技醫療業    
    otc5 = ['1565','1593','1752','1777','1781','1784','1788','1799','1813','3118','3176','3205','3218','4102','4105','4107','4109','4111','4114','4116','4120','4121','4123','4126','4127','4128','4129','4130','4131','4138','4139','4147','4152','4153','4154','4157','4160','4161','4162','4163','4167','4168','4173','4174','4175','4183','4188','4192','4198','4726','4728','4735','4736','4743','4744','4745','4747','4911','5312','6130','6242','6446','6461','6469','6472','6492','6496','6499','6523','6527','6535','6547','6569','6574','6576','6589','6612','6615','6649','6662','8279','8403','8406','8409','8432','8436']
    #上櫃光電業    
    otc6 = ['3066','3128','3230','3297','3339','3362','3434','3441','3455','3490','3516','3523','3531','3615','3623','3630','3666','3685','3691','3713','4729','4933','4944','4972','4995','5220','5230','5245','5251','5281','5315','5371','5392','5432','5443','6125','6167','6222','6234','6244','6246','6419','6556','6560','7402','8049','8064','8069','8087','8111','8240']
    #上櫃農業科技    
    otc7 = ['1240','4171','6508','6578']
    #上櫃其他     
    otc8 = ['1584','2221','2640','3284','4430','4529','4541','4556','4950','5276','5306','5398','5450','5481','5530','6179','6199','6236','6616','6624','6629','6803','8342','8390','8401','8418','8420','8421','8423','8426','8435','8437','8440','8444','8476','8905','8906','8916','8921','8924','8928','8929','8932','8933','8934','8935','8936','8937','8938','8942']
    #上櫃其他電子    
    otc9 = ['1785','3067','3093','3131','3285','3289','3303','3324','3373','3402','3498','3508','3541','3551','3552','3580','3587','3628','3642','3663','4554','4760','5205','5383','5452','5489','5493','5536','6146','6151','6187','6247','6275','6438','6512','6613','6654','6667','8047','8085','8092','8183','8383','8431','8455']
    #上櫃油電燃氣業    
    otc10 = ['8908','8917','8927','8931']


    #上櫃電子商務
    otc11 = ['3085','3687','5278','5287','8044','8472','8477']
    #上櫃食品工業
    otc12 = ['1258','1264','1796','4205','4207','4712']
    #上櫃觀光事業   
    otc13 = ['1259','1268','2718','2719','2724','2726','2729','2732','2734','2736','2740','2743','2745','2752','2754','2928','3252','3522','4804','5301','5364','5701','5703','5704','8077']
    #上櫃通信網路 
    otc14 = ['3081','3095','3152','3163','3221','3234','3306','3363','3466','3491','3499','3558','3564','3632','3664','3672','3684','4903','4905','4908','4909','4979','5348','5353','6109','6143','6163','6170','6190','6218','6241','6245','6263','6417','6426','6465','6470','6486','6514','6530','6561','6588','8034','8048','8059','8097','8171','8176']
    #上櫃造紙工業   
    otc15 = ['2916','2924','2937','3171','5902','5903','5904','5905','6195','8066','8433','8941','9960']
    #上櫃貿易百貨    
    otc16 = ['1432','2601','2614','2901','2903','2905','2906','2908','2910','2911','2912','2913','2915','2929','2936','2939','4807','5906','5907','8429','8443','8454']
    #上櫃塑膠工業   
    otc17 = ['4303','4304','4305','8354','9950']
    #上櫃資訊服務   
    otc18 = ['3147','3570','4953','5201','5202','5209','5210','5211','5212','5310','5403','5410','6140','6148','6221','6231','6240','6404','6516','6590','6593','6690','6697','8099','8284','8416']
    #上櫃電子通路 
    otc19 = ['3224','3232','3360','3444','6113','6118','6154','6227','6265','6270','8032','8067','8068','8084','8096']
    #上櫃電子零組件 
    otc20 = ['1333','1336','1595','1815','3078','3089','3092','3114','3115','3144','3191','3202','3206','3207','3217','3236','3276','3288','3290','3294','3310','3313','3322','3332','3354','3388','3390','3465','3484','3492','3511','3512','3520','3526','3537','3548','3597','3609','3624','3631','3646','3689','3710','4542','4939','4974','5227','5291','5309','5321','5328','5340','5345','5349','5355','5381','5439','5457','5460','5464','5475','5488','5498','6114','6124','6126','6127','6134','6156','6158','6173','6174','6175','6185','6194','6203','6204','6207','6208','6210','6217','6220','6259','6266','6274','6279','6284','6290','6292','6418','6432','6538','6642','6664','8038','8042','8043','8071','8074','8080','8091','8093','8109','8121','8147','8155','8182','8289','8291','8358']

    #上櫃電腦及週邊設備業
    otc21 = ['1569','3071','3088','3211','3213','3272','3287','3323','3325','3479','3483','3521','3540','3577','3594','3611','3625','3652','3693','3709','4924','4931','4987','5223','5289','5304','5356','5386','5426','5438','5465','5474','5490','6121','6123','6150','6160','6161','6188','6228','6276','6441','6570','6577','6680','8050','8076','8234','8410']
    #上櫃電器電纜
    otc22 = ['2061','4609']
    #上櫃電機機械    
    otc23 = ['1570','1580','1586','1591','1597','1599','2066','2067','2070','2230','2235','3162','3178','3226','3379','3426','4502','4503','4506','4510','4513','4523','4527','4528','4530','4533','4534','4535','4538','4543','4549','4550','4561','4563','4568','4580','6122','6425','6603','6609','8027','8083','8107','8255','9951']
    #上櫃橡膠工業
    otc24 = ['5102']
    #上櫃鋼鐵工業   
    otc25 = ['2035','2063','2064','2065','5009','5011','5013','5014','5015','5016','6248','8349','8415','8930','9962']



    if (mess == "otc1"):
        Xgroup = '上櫃化學工業'
        signs = DB.objects.filter(cStockID__in = otc1).order_by('-cAverageScore')                
    elif (mess == "otc2"):
        Xgroup = '上櫃文化創意產業'
        signs = DB.objects.filter(cStockID__in = otc2).order_by('-cAverageScore')
    elif (mess == "otc3"):
        Xgroup = '上櫃紡織工業'
        signs = DB.objects.filter(cStockID__in = otc3).order_by('-cAverageScore')
    elif (mess == "otc4"):
        Xgroup = '上櫃半導體工業'
        signs = DB.objects.filter(cStockID__in = otc4).order_by('-cAverageScore')
    elif (mess == "otc5"):
        Xgroup = '上櫃生技醫療業'
        signs = DB.objects.filter(cStockID__in = otc5).order_by('-cAverageScore')
    elif (mess == "otc6"):
        Xgroup = '上櫃光電業'
        signs = DB.objects.filter(cStockID__in = otc6).order_by('-cAverageScore')
    elif (mess == "otc7"):
        Xgroup = '上櫃農業科技'
        signs = DB.objects.filter(cStockID__in = otc7).order_by('-cAverageScore')
    elif (mess == "otc8"):
        Xgroup = '上櫃其他'
        signs = DB.objects.filter(cStockID__in = otc8).order_by('-cAverageScore')
    elif (mess == "otc9"):
        Xgroup = '上櫃其他電子'
        signs = DB.objects.filter(cStockID__in = otc9).order_by('-cAverageScore')
    elif (mess == "otc10"):
        Xgroup = '上櫃油電燃氣業'
        signs = DB.objects.filter(cStockID__in = otc10).order_by('-cAverageScore')


    elif (mess == "otc11"):
        Xgroup = '上櫃電子商務'
        signs = DB.objects.filter(cStockID__in = otc11).order_by('-cAverageScore')                
    elif (mess == "otc12"):
        Xgroup = '上櫃食品工業'
        signs = DB.objects.filter(cStockID__in = otc12).order_by('-cAverageScore')
    elif (mess == "otc13"):
        Xgroup = '上櫃航運業'
        signs = DB.objects.filter(cStockID__in = otc13).order_by('-cAverageScore')
    elif (mess == "otc14"):
        Xgroup = '上櫃通信網路'
        signs = DB.objects.filter(cStockID__in = otc14).order_by('-cAverageScore')
    elif (mess == "otc15"):
        Xgroup = '上櫃造紙工業'
        signs = DB.objects.filter(cStockID__in = otc15).order_by('-cAverageScore')
    elif (mess == "otc16"):
        Xgroup = '上櫃貿易百貨'
        signs = DB.objects.filter(cStockID__in = otc16).order_by('-cAverageScore')
    elif (mess == "otc17"):
        Xgroup = '上櫃塑膠工業'
        signs = DB.objects.filter(cStockID__in = otc17).order_by('-cAverageScore')
    elif (mess == "otc18"):
        Xgroup = '上櫃資訊服務'
        signs = DB.objects.filter(cStockID__in = otc18).order_by('-cAverageScore')
    elif (mess == "otc19"):
        Xgroup = '上櫃電子通路'
        signs = DB.objects.filter(cStockID__in = otc19).order_by('-cAverageScore')
    elif (mess == "otc20"):
        Xgroup = '上櫃電子零組件'
        signs = DB.objects.filter(cStockID__in = otc20).order_by('-cAverageScore')


    elif (mess == "otc21"):
        Xgroup = '上櫃電腦及週邊設備業'
        signs = DB.objects.filter(cStockID__in = otc21).order_by('-cAverageScore')                
    elif (mess == "otc22"):
        Xgroup = '上櫃電器電纜'
        signs = DB.objects.filter(cStockID__in = otc22).order_by('-cAverageScore')
    elif (mess == "otc23"):
        Xgroup = '上櫃電機機械'
        signs = DB.objects.filter(cStockID__in = otc23).order_by('-cAverageScore')
    elif (mess == "otc24"):
        Xgroup = '上櫃橡膠工業'
        signs = DB.objects.filter(cStockID__in = otc24).order_by('-cAverageScore')
    elif (mess == "otc25"):
        Xgroup = '上櫃鋼鐵工業'
        signs = DB.objects.filter(cStockID__in = otc25).order_by('-cAverageScore')



    return render(request, "stock6listallotc.html", locals())
